#include "ui.h"
#include "armhook.h"
#include "utils.h"
#include "pattern.h"
#include "touch.h"
#include "strutils.h"
#include "memutils.h"

#ifndef ANDROID
#include "psplang.h"
#endif

namespace ui
{
	typedef void (*fn_Draw_Poly)(float, float, float, float, float, float, float, float, uint8_t *);
	fn_Draw_Poly draw_poly;

	enum eAlign
	{
		eAlignCenter,
		eAlignLeft,
		eAlignRight
	};

	enum eStyle
	{
		eStyleSimple,
		eStyleClassic,
		eStyleSpecial
	};

	typedef void (*fn_Print_String)(uint16_t *str, float x, float y, eAlign align, float scalex, float scaley, uint8_t *rgba, eStyle style);
	fn_Print_String print_string;

	void on_draw();

	uint8_t menu_arrow_color[4];
	uint8_t menu_arrow_selected_alpha;
	uint8_t menu_active_item_font_color[4];
	uint8_t menu_selected_item_font_color[4];

#ifdef ANDROID

	namespace gta3
	{
		// @CSprite2d::SetVertices
		typedef void (*fn_CSprite2d__SetVertices)(float, float, float, float, float, float, float, float, uint8_t *, uint8_t *, uint8_t *, uint8_t *);
		fn_CSprite2d__SetVertices CSprite2d__SetVertices;

		// @RwRenderStateSet
		typedef int32_t (*fn_RwRenderStateSet)(int32_t state, int32_t val);
		fn_RwRenderStateSet RwRenderStateSet;

		// @RwIm2DRenderPrimitive
		typedef void (*fn_RwIm2DRenderPrimitive)(int32_t type, void *verts, int32_t count);
		fn_RwIm2DRenderPrimitive RwIm2DRenderPrimitive;

		// @CSprite2d::maVertices
		void *CSprite2d__maVertices;

		// @CHud::Draw
		typedef void (*fn_CHud__Draw)();
		fn_CHud__Draw _CHud__Draw, CHud__Draw_;
		void CHud__Draw()
		{
			CHud__Draw_();
			on_draw();
		}

		// @CFont::Details
		#pragma pack(push, 1)
		struct _CFont__Details
		{
			uint32_t	m_dwColor;				// 0x00
			float		m_fScaleX;	 			// 0x04
			float		m_fScaleY;	 			// 0x08
			float		m_fSlant;	 			// 0x0C
			float		m_fSlantRefPointX;		// 0x10
			float		m_fSlantRefPointY;		// 0x14
			bool		m_bLeftJustify;			// 0x18
			bool		m_bCentre;				// 0x19
			bool		m_bRightJustify;		// 0x1A
			bool		m_bBackground;			// 0x1B
			bool		m_bBackGroundOnlyText;	// 0x1C
			bool		m_bProp;				// 0x1D
			uint16_t	m_bPad0;				// 0x1E
			float		m_fAlphaFade; 			// 0x20
			uint32_t	m_dwBackgroundColor;	// 0x24
			float		m_fWrapx;	 			// 0x28
			float		m_fCentreSize; 			// 0x2C
			float		m_fRightJustifyWrap;	// 0x30
			uint16_t	m_wFontStyle;			// 0x34
			uint16_t	m_wPad0;				// 0x36
			uint32_t	m_dwUnk3;				// 0x38
			uint16_t	m_wDropShadowPosition;	// 0x3C
			uint32_t	m_dwDropColor;			// 0x3E
			uint16_t	m_wPad1;				// 0x42
		} *CFont__Details;
		#pragma pack(pop)

		STRUCT_SIZE(_CFont__Details, 0x44);

		// @CFont::SetFontStyle
		typedef void (*fn_CFont__SetFontStyle)(uint16_t);
		fn_CFont__SetFontStyle CFont__SetFontStyle;

		// @CFont::PrintString
		typedef void (*fn_CFont__PrintString)(float, float, uint16_t *);
		fn_CFont__PrintString CFont__PrintString;

		// @RsGlobal
		void *RsGlobal;

		float trans_x(float x) { return x * *cast<int32_t *>(cast<uint32_t>(RsGlobal) + 12); }
		float trans_y(float y) { return y * *cast<int32_t *>(cast<uint32_t>(RsGlobal) + 16); }

		void _draw_poly(float topleftx, float toplefty, float toprightx, float toprighty,
					  float bottomleftx, float bottomlefty, float bottomrightx, float bottomrighty, uint8_t *rgba)
		{
			CSprite2d__SetVertices(trans_x(topleftx), trans_y(toplefty), trans_x(toprightx), trans_y(toprighty),
					 	 	 	 trans_x(bottomleftx), trans_y(bottomlefty), trans_x(bottomrightx), trans_y(bottomrighty),
					 	 	 	 rgba, rgba, rgba, rgba);
			RwRenderStateSet(1, 0);
			RwRenderStateSet(7, 1);
			RwRenderStateSet(6, 0);
			RwRenderStateSet(8, 0);
			RwRenderStateSet(12, rgba[3] != 255);
			RwIm2DRenderPrimitive(5, CSprite2d__maVertices, 4);
			RwRenderStateSet(6, 1);
			RwRenderStateSet(8, 1);
			RwRenderStateSet(7, 2);
		}

		void _print_string(uint16_t *str, float x, float y, eAlign align, float scalex, float scaley, uint8_t *rgba, eStyle style)
		{
			// save current font settings
			_CFont__Details	*fd = CFont__Details;
			_CFont__Details fdbcp = *fd;

			// set font align
			fd->m_bCentre = false;
			fd->m_bLeftJustify = false;
			fd->m_bRightJustify = false;
			switch (align)
			{
			case eAlignCenter:
				fd->m_bCentre = true;
				break;
			case eAlignLeft:
				fd->m_bLeftJustify = true;
				break;
			case eAlignRight:
				fd->m_bRightJustify = true;
				break;
			}
			// style
			switch (style)
			{
			case eStyleClassic:
				CFont__SetFontStyle(2);
				scalex *= 2.6;
				scaley *= 1.5;
				break;
			case eStyleSimple:
				CFont__SetFontStyle(2);
				scalex *= 2.4;
				scaley *= 1.3;
				break;
			case eStyleSpecial:
				CFont__SetFontStyle(0);
				break;
			}
			// scale
			fd->m_fScaleX = scalex;
			fd->m_fScaleY = scaley;
			// color
			fd->m_dwColor = *cast<uint32_t*>(rgba);
			// common
			fd->m_bBackground = false;
			fd->m_bProp = true;
			fd->m_wDropShadowPosition = 1;
			fd->m_dwDropColor = 0xFF000000;

			// print string
			CFont__PrintString(trans_x(x), trans_y(y), str);

			// restore font settings
			*fd = fdbcp;
		}

		void init()
		{
			// @CSprite2d::SetVertices
			CSprite2d__SetVertices = getsym<fn_CSprite2d__SetVertices>("_ZN9CSprite2d11SetVerticesEffffffffRK5CRGBAS2_S2_S2_");
			// @RwRenderStateSet
			RwRenderStateSet = getsym<fn_RwRenderStateSet>("_Z16RwRenderStateSet13RwRenderStatePv");
			// @RwIm2DRenderPrimitive
			RwIm2DRenderPrimitive = getsym<fn_RwIm2DRenderPrimitive>("_Z21RwIm2DRenderPrimitive15RwPrimitiveTypeP14RwOpenGLVertexi");
			// @CSprite2d::maVertices
			CSprite2d__maVertices = getsym<void *>("_ZN9CSprite2d10maVerticesE");

			// @CHud::Draw
			_CHud__Draw = getsym<fn_CHud__Draw>("_ZN4CHud4DrawEv");
			armhook::hook_thumb_func(_CHud__Draw, 4, CHud__Draw, &CHud__Draw_);
			// @CFont::Details
			CFont__Details = getsym<_CFont__Details*>("_ZN5CFont7DetailsE");
			// @CFont::SetFontStyle
			CFont__SetFontStyle = getsym<fn_CFont__SetFontStyle>("_ZN5CFont12SetFontStyleEs");
			// @CFont::PrintString
			CFont__PrintString = getsym<fn_CFont__PrintString>("_ZN5CFont11PrintStringEffPt");
			// @RsGlobal
			RsGlobal = getsym<void *>("RsGlobal");

			draw_poly = _draw_poly;
			print_string = _print_string;

			uint8_t color[4] = {225, 216, 161, 255};
			memcpy(menu_selected_item_font_color, color, sizeof(color));
			uint8_t arrow_color[4] = { 55, 127, 175, 110 };
			memcpy(menu_arrow_color, arrow_color, sizeof(arrow_color));
			menu_arrow_selected_alpha = 220;
		}
	}

	namespace vc
	{
		// @CSprite2d::Draw2DPolygon
		typedef void (*fn_CSprite2d__Draw2DPolygon)(float, float, float, float, float, float, float, float, uint8_t *);
		fn_CSprite2d__Draw2DPolygon CSprite2d__Draw2DPolygon;

		// @CHud::Draw
		typedef void (*fn_CHud__Draw)();
		fn_CHud__Draw _CHud__Draw, CHud__Draw_;
		void CHud__Draw()
		{
			CHud__Draw_();
			on_draw();
		}

		// @CFont::Details
		#pragma pack(push, 1)
		struct _CFont__Details
		{
			uint32_t	m_dwColor;				// 0x00
			float		m_fScaleX;	 			// 0x04
			float		m_fScaleY;	 			// 0x08
			float		m_fSlant;	 			// 0x0C
			float		m_fSlantRefPointX;		// 0x10
			float		m_fSlantRefPointY;		// 0x14
			bool		m_bLeftJustify;			// 0x18
			bool		m_bCentre;				// 0x19
			bool		m_bRightJustify;		// 0x1A
			bool		m_bBackground;			// 0x1B
			bool		m_bBackGroundOnlyText;	// 0x1C
			bool		m_bProp;				// 0x1D
			bool		m_bUnk0;				// 0x1E
			bool		m_bFlash;				// 0x1F
			uint32_t	m_dwUnk1;				// 0x20
			float		m_fAlphaFade; 			// 0x24
			uint32_t	m_dwBackgroundColor;	// 0x28
			float		m_fWrapx;	 			// 0x2C
			float		m_fCentreSize; 			// 0x30
			float		m_fRightJustifyWrap;	// 0x34
			uint16_t	m_wFontStyle;			// 0x38
			bool		m_bFontStyle_unk;		// 0x3A
			bool		m_bUnk2;				// 0x3B
			uint32_t	m_dwUnk3;				// 0x3C
			uint16_t	m_wDropShadowPosition;	// 0x40
			uint32_t	m_dwDropColor;			// 0x42
			uint8_t		m_bUnk4[0x12];			// 0x46
		} *CFont__Details;
		#pragma pack(pop)

		STRUCT_SIZE(_CFont__Details, 0x58);

		// @CFont::SetFontStyle
		typedef void (*fn_CFont__SetFontStyle)(uint16_t);
		fn_CFont__SetFontStyle CFont__SetFontStyle;

		// @CFont::PrintString
		typedef void (*fn_CFont__PrintString)(float, float, uint16_t *);
		fn_CFont__PrintString CFont__PrintString;

		// @RsGlobal
		void *RsGlobal;

		float trans_x(float x) { return x * *cast<int32_t *>(cast<uint32_t>(RsGlobal) + 12); }
		float trans_y(float y) { return y * *cast<int32_t *>(cast<uint32_t>(RsGlobal) + 16); }

		void _draw_poly(float topleftx, float toplefty, float toprightx, float toprighty,
					  float bottomleftx, float bottomlefty, float bottomrightx, float bottomrighty, uint8_t *rgba)
		{
			CSprite2d__Draw2DPolygon(trans_x(topleftx), trans_y(toplefty), trans_x(toprightx), trans_y(toprighty),
									 trans_x(bottomleftx), trans_y(bottomlefty), trans_x(bottomrightx), trans_y(bottomrighty), rgba);
		}

		void _print_string(uint16_t *str, float x, float y, eAlign align, float scalex, float scaley, uint8_t *rgba, eStyle style)
		{
			// save current font settings
			_CFont__Details	*fd = CFont__Details;
			_CFont__Details fdbcp = *fd;

			// set font align
			fd->m_bCentre = false;
			fd->m_bLeftJustify = false;
			fd->m_bRightJustify = false;
			switch (align)
			{
			case eAlignCenter:
				fd->m_bCentre = true;
				break;
			case eAlignLeft:
				fd->m_bLeftJustify = true;
				break;
			case eAlignRight:
				fd->m_bRightJustify = true;
				break;
			}
			// style
			switch (style)
			{
			case eStyleClassic:
				CFont__SetFontStyle(2);
				scalex *= 1.9;
				scaley *= 1.5;
				break;
			case eStyleSimple:
				CFont__SetFontStyle(2);
				scalex *= 1.8;
				scaley *= 1.3;
				break;
			case eStyleSpecial:
				CFont__SetFontStyle(0);
				break;
			}
			// scale
			fd->m_fScaleX = scalex;
			fd->m_fScaleY = scaley;
			// color
			fd->m_dwColor = *cast<uint32_t*>(rgba);
			// common
			fd->m_bBackground = false;
			fd->m_bFlash = false;
			fd->m_bProp = true;
			fd->m_wDropShadowPosition = 1;
			fd->m_dwDropColor = 0xFF000000;

			// print string
			CFont__PrintString(trans_x(x), trans_y(y), str);

			// restore font settings
			*fd = fdbcp;
		}

		void init()
		{
			// @CSprite2d::Draw2DPolygon
			CSprite2d__Draw2DPolygon = getsym<fn_CSprite2d__Draw2DPolygon>("_ZN9CSprite2d13Draw2DPolygonEffffffffRK5CRGBA");
			// @CHud::Draw
			_CHud__Draw = getsym<fn_CHud__Draw>("_ZN4CHud4DrawEv");
			armhook::hook_thumb_func(_CHud__Draw, 4, CHud__Draw, &CHud__Draw_);
			// @CFont::Details
			CFont__Details = getsym<_CFont__Details*>("_ZN5CFont7DetailsE");
			// @CFont::SetFontStyle
			CFont__SetFontStyle = getsym<fn_CFont__SetFontStyle>("_ZN5CFont12SetFontStyleEs");
			// @CFont::PrintString
			CFont__PrintString = getsym<fn_CFont__PrintString>("_ZN5CFont11PrintStringEffPt");
			// @RsGlobal
			RsGlobal = getsym<void *>("RsGlobal");

			draw_poly = _draw_poly;
			print_string = _print_string;

			uint8_t color[4] = {225, 216, 161, 255};
			memcpy(menu_selected_item_font_color, color, sizeof(color));
			uint8_t arrow_color[4] = { 55, 127, 175, 110 };
			memcpy(menu_arrow_color, arrow_color, sizeof(arrow_color));
			menu_arrow_selected_alpha = 220;
		}
	}

	namespace sa
	{
		// @CSprite2d::Draw2DPolygon
		typedef void (*fn_CSprite2d__Draw2DPolygon)(float, float, float, float, float, float, float, float, uint8_t *);
		fn_CSprite2d__Draw2DPolygon CSprite2d__Draw2DPolygon;

		// @CHud::Draw
		typedef void (*fn_CHud__Draw)();
		fn_CHud__Draw _CHud__Draw, CHud__Draw_;
		void CHud__Draw()
		{
			CHud__Draw_();
			on_draw();
		}

		// @CFont::Details
		#pragma pack(push, 1)
		struct _CFont__Details
		{
			uint32_t	m_dwColor;				// 0x00
			float		m_fScaleX;	 			// 0x04
			float		m_fScaleY;	 			// 0x08
			float		m_fSlant;	 			// 0x0C
			float		m_fSlantRefPointX;		// 0x10
			float		m_fSlantRefPointY;		// 0x14
			bool		m_bLeftJustify;			// 0x18
			bool		m_bCentre;				// 0x19
			bool		m_bRightJustify;		// 0x1A
			bool		m_bBackground;			// 0x1B
			bool		m_bBackGroundOnlyText;	// 0x1C
			bool		m_bProp;				// 0x1D
			bool		m_bUnk0;				// 0x1E
			bool		m_bFlash;				// 0x1F
			float		m_fAlpha; 				// 0x20
			uint32_t	m_dwBackgroundColor;	// 0x24
			float		m_fWrapx;	 			// 0x28
			float		m_fCentreSize; 			// 0x2C
			float		m_fRightJustifyWrap;	// 0x30
			uint8_t		m_bFontStyle;			// 0x34
			uint8_t		m_bFontStyle_unk;		// 0x35
			uint8_t		m_bDropShadowPosition;	// 0x36
			uint32_t	m_dwDropColor;			// 0x37
			uint8_t		m_bEdge1;				// 0x3B
			uint8_t		m_bEdge2;				// 0x3C
			uint8_t		padding[3];				// 0x3D
		} *CFont__Details;
		#pragma pack(pop)

		STRUCT_SIZE(_CFont__Details, 0x40);

		// @CFont::SetFontStyle
		typedef void (*fn_CFont__SetFontStyle)(uint8_t);
		fn_CFont__SetFontStyle CFont__SetFontStyle;

		// @CFont::PrintString
		typedef void (*fn_CFont__PrintString)(float, float, uint16_t *);
		fn_CFont__PrintString CFont__PrintString;

		// @RsGlobal
		void *RsGlobal;

		float trans_x(float x) { return x * *cast<int32_t *>(cast<uint32_t>(RsGlobal) + 4); }
		float trans_y(float y) { return y * *cast<int32_t *>(cast<uint32_t>(RsGlobal) + 8); }

		void _draw_poly(float topleftx, float toplefty, float toprightx, float toprighty,
					  float bottomleftx, float bottomlefty, float bottomrightx, float bottomrighty, uint8_t *rgba)
		{
			CSprite2d__Draw2DPolygon(trans_x(topleftx), trans_y(toplefty), trans_x(toprightx), trans_y(toprighty),
									 trans_x(bottomleftx), trans_y(bottomlefty), trans_x(bottomrightx), trans_y(bottomrighty), rgba);
		}

		void _print_string(uint16_t *str, float x, float y, eAlign align, float scalex, float scaley, uint8_t *rgba, eStyle style)
		{
			// utils::log("%x %d %d %d %d", rgba, rgba[0], rgba[1], rgba[2], rgba[3]);

			// save current font settings
			_CFont__Details	*fd = CFont__Details;
			_CFont__Details fdbcp = *fd;

			// set font align
			fd->m_bCentre = false;
			fd->m_bLeftJustify = false;
			fd->m_bRightJustify = false;
			switch (align)
			{
			case eAlignCenter:
				fd->m_bCentre = true;
				break;
			case eAlignLeft:
				fd->m_bLeftJustify = true;
				break;
			case eAlignRight:
				fd->m_bRightJustify = true;
				break;
			}
			// style
			switch (style)
			{
			case eStyleClassic:
				CFont__SetFontStyle(3);
				scalex *= 1.9;
				scaley *= 1.5;
				break;
			case eStyleSimple:
				CFont__SetFontStyle(2);
				scalex *= 1.4;
				scaley *= 1.3;
				break;
			case eStyleSpecial:
				CFont__SetFontStyle(0);
				break;
			}
			// scale
			fd->m_fScaleX = scalex;
			fd->m_fScaleY = scaley;
			// color
			fd->m_dwColor = *cast<uint32_t*>(rgba);
			// common
			fd->m_bBackground = false;
			fd->m_bFlash = false;
			fd->m_bProp = true;
			fd->m_bDropShadowPosition = 1;
			fd->m_bEdge1 = 0;
			fd->m_bEdge2 = 0;
			fd->m_dwDropColor = 0xFF000000;

			// print string
			CFont__PrintString(trans_x(x), trans_y(y), str);

			// restore font settings
			*fd = fdbcp;
		}

		void init()
		{
			// @CSprite2d::Draw2DPolygon
			CSprite2d__Draw2DPolygon = getsym<fn_CSprite2d__Draw2DPolygon>("_ZN9CSprite2d13Draw2DPolygonEffffffffRK5CRGBA");
			// @CHud::Draw
			_CHud__Draw = getsym<fn_CHud__Draw>("_ZN4CHud4DrawEv");
			armhook::hook_thumb_func(_CHud__Draw, 4, CHud__Draw, &CHud__Draw_);
			// @CFont::Details
			CFont__Details = getsym<_CFont__Details*>("_ZN5CFont7DetailsE");
			// @CFont::SetFontStyle
			CFont__SetFontStyle = getsym<fn_CFont__SetFontStyle>("_ZN5CFont12SetFontStyleEh");
			// @CFont::PrintString
			CFont__PrintString = getsym<fn_CFont__PrintString>("_ZN5CFont11PrintStringEffPt");
			// @RsGlobal
			RsGlobal = getsym<void *>("RsGlobal");

			draw_poly = _draw_poly;
			print_string = _print_string;

			uint8_t color[4] = { 40, 235, 24, 255 };
			memcpy(menu_selected_item_font_color, color, sizeof(color));
			uint8_t arrow_color[4] = { 55, 127, 175, 100 };
			memcpy(menu_arrow_color, arrow_color, sizeof(arrow_color));
			menu_arrow_selected_alpha = 180;
		}
	}

#endif

	namespace lcs
	{
		// @CSprite2d::Draw2DPolygon
		typedef void (*fn_CSprite2d__Draw2DPolygon)(float, float, float, float, float, float, float, float, uint8_t *);
		fn_CSprite2d__Draw2DPolygon CSprite2d__Draw2DPolygon;

		// @CHud::Draw
		typedef void (*fn_CHud__Draw)();
		fn_CHud__Draw _CHud__Draw, CHud__Draw_;
		void CHud__Draw()
		{
			CHud__Draw_();
			on_draw();
		}

		// @CFont::Details
		#pragma pack(push, 1)
		struct _CFont__Details
		{
			uint32_t	m_dwColor;				// 0x00
			float		m_fScaleX;	 			// 0x04
			float		m_fScaleY;	 			// 0x08
			float		m_fSlant;	 			// 0x0C
			float		m_fSlantRefPointX;		// 0x10
			float		m_fSlantRefPointY;		// 0x14
			bool		m_bLeftJustify;			// 0x18
			bool		m_bCentre;				// 0x19
			bool		m_bRightJustify;		// 0x1A
			bool		m_bBackground;			// 0x1B
			bool		m_bBackGroundOnlyText;	// 0x1C
			bool		m_bProp;				// 0x1D
			bool		m_bUnk0;				// 0x1E
			bool		m_bFlash;				// 0x1F
			uint32_t	m_dwUnk1;				// 0x20
			float		m_fAlphaFade; 			// 0x24
			uint32_t	m_dwBackgroundColor;	// 0x28
			float		m_fWrapx;	 			// 0x2C
			float		m_fCentreSize; 			// 0x30
			float		m_fRightJustifyWrap;	// 0x34
			uint16_t	m_wFontStyle;			// 0x38
			bool		m_bFontStyle_unk;		// 0x3A
			bool		m_bUnk2;				// 0x3B
			uint32_t	m_dwUnk3;				// 0x3C
			uint16_t	m_wDropShadowPosition;	// 0x40
			uint16_t	m_wUnkPad;				// 0x42
			uint32_t	m_dwDropColor;			// 0x44
			uint32_t	m_dwUnk4[4];			// 0x48
			uint32_t	m_dwOutlineColor;		// 0x58
			uint32_t	m_bOutlineOn;			// 0x5C
			uint32_t	m_dwNewLineAdd;			// 0x60
#ifdef ANDROID
			float		m_fIconScale; 			// 0x64
			float		m_fIconYCorrection;		// 0x68
			float		m_fIconXCorrection;		// 0x6C
#endif
		} *CFont__Details;
		#pragma pack(pop)

#ifdef ANDROID
		STRUCT_SIZE(_CFont__Details, 0x70);
#else
		STRUCT_SIZE(_CFont__Details, 0x64);
#endif

		// @CFont::SetFontStyle
		typedef void (*fn_CFont__SetFontStyle)(uint16_t);
		fn_CFont__SetFontStyle CFont__SetFontStyle;

		// @CFont::PrintString
		typedef void (*fn_CFont__PrintString)(float, float, uint16_t *, float *);
		fn_CFont__PrintString CFont__PrintString;

#ifdef ANDROID
		float trans_x(float x) { return x * 640.0; }
		float trans_y(float y) { return y * 448.0; }
#else
		float trans_x(float x) { return x * 480.0; }
		float trans_y(float y) { return y * 272.0; }
#endif

		void _draw_poly(float topleftx, float toplefty, float toprightx, float toprighty,
					  float bottomleftx, float bottomlefty, float bottomrightx, float bottomrighty, uint8_t *rgba)
		{
			CSprite2d__Draw2DPolygon(trans_x(topleftx), trans_y(toplefty), trans_x(toprightx), trans_y(toprighty),
